; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet16)
	(supports instrument6 infrared0)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(pointing satellite2 Star14)
	(pointing satellite3 GroundStation1)
	(have_image Planet6 infrared0)
	(have_image Phenomenon7 infrared0)
	(have_image Star8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Star10 thermograph1)
	(have_image Planet11 infrared0)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Star14 infrared0)
	(have_image Phenomenon15 thermograph1)
	(have_image Planet16 thermograph1)
	(have_image Star17 infrared0)
))

)

; plan
1. (turn_to satellite2 groundstation5 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 15
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 15
3. (calibrate satellite2 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 15
4. (turn_to satellite2 planet12 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet12)
   goals met: 0 of 15
5. (take_image satellite2 planet12 instrument5 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 1 of 15
6. (turn_to satellite2 planet11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet11)
   goals met: 1 of 15
7. (take_image satellite2 planet11 instrument5 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 15
8. (turn_to satellite2 phenomenon7 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 15
9. (take_image satellite2 phenomenon7 instrument5 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 3 of 15
10. (turn_to satellite2 phenomenon15 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon15)
   goals met: 3 of 15
11. (take_image satellite2 phenomenon15 instrument5 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 4 of 15
12. (turn_to satellite2 phenomenon13 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon13)
   goals met: 4 of 15
13. (turn_to satellite0 groundstation3 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 15
14. (take_image satellite2 phenomenon13 instrument5 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 6 of 15
15. (turn_to satellite2 planet16 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet16)
   goals met: 6 of 15
16. (take_image satellite2 planet16 instrument5 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 7 of 15
17. (turn_to satellite2 planet6 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet6)
   goals met: 7 of 15
18. (take_image satellite2 planet6 instrument5 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 8 of 15
19. (turn_to satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   goals met: 8 of 15
20. (take_image satellite2 star10 instrument5 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 9 of 15
21. (turn_to satellite2 star17 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star17)
   goals met: 9 of 15
22. (take_image satellite2 star17 instrument5 infrared0)
   added: (have_image star17 infrared0)
   goals met: 10 of 15
23. (turn_to satellite2 star8 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star8)
   goals met: 10 of 15
24. (take_image satellite2 star8 instrument5 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 11 of 15
25. (turn_to satellite2 star9 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star9)
   goals met: 11 of 15
26. (take_image satellite2 star9 instrument5 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 12 of 15
27. (turn_to satellite2 star14 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star14)
   goals met: 13 of 15
28. (take_image satellite2 star14 instrument5 infrared0)
   added: (have_image star14 infrared0)
   goals met: 14 of 15
29. (turn_to satellite3 groundstation1 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation1)
   goals met: 15 of 15
